In [94]:
import pandas as pd
df=pd.read_csv("income.csv")
d=df.copy()
d

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [86]:
df.columns

Index(['GEOID', 'State', '2005', '2006', '2007', '2008', '2009', '2010',
       '2011', '2012', '2013'],
      dtype='object')

In [6]:
df.loc[0:]

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [7]:
df["2010"]

0    40933
1    57848
2    46896
3    38587
4    54283
Name: 2010, dtype: int64

In [9]:
s=0                                                          #sum of particular column
for i in df["2010"]:
    s=s+i
print(i)

54283

In [15]:
# to find the sum of row
#df.iloc[1,2:]
s=0
for i in df.iloc[1,2:]:
    s=s+i
print(s)

540959

In [16]:
df["2010"].sum()

238547

In [21]:
#4th row and all columns sum
df.iloc[4,2:].sum()

498154

In [26]:
#sum of 2005 to 2008 colums
k=df.iloc[:,2:6].sum()
k.sum()

976808

In [33]:
s=df.iloc[:,2:].sum()
s.sum()

2199422

In [35]:
df.sum()                #to find the total sum of individual columns

GEOID    04000US0104000US0204000US0404000US0504000US06
State           AlabamaAlaskaArizonaArkansasCalifornia
2005                                            226699
2006                                            233403
2007                                            264727
2008                                            251979
2009                                            239995
2010                                            238547
2011                                            243311
2012                                            250194
2013                                            250567
dtype: object

In [36]:
df.sum(1)                 #to find the total sum of individual rows

0    370138
1    540959
2    440711
3    349460
4    498154
dtype: int64

In [45]:
#prod()to find the product of 1 to 2 rows upto 2008 columns
k=df.iloc[1:3,2:6].prod()
k.prod()

3892897880436685324

In [55]:
#mean() to find the average
#find the avg of 2011 column


df["2011"].mean()

48662.2

In [59]:
#find the avg of 2nd row
df.iloc[2,2:].mean()

48967.88888888889

In [60]:
# median()   
#find the median of 2011 column
df["2011"].median()

48621.0

In [61]:
#find the median of 2nd row
df.iloc[2,2:].median()

46914.0

### Combined Average Income of all states from 2005 to 2013

In [110]:
df.iloc[:,2:].mean().mean()   #column wise avg
#df.iloc[:,2:].mean(1)-------> row wise avg

48876.044444444444

In [115]:
import pandas as pd
d=pd.read_csv("income.csv",index_col="State")
#d.index=d["State"]
d

,GEOID,2005,2006,2007,2008,2009,2010,2011,2012,2013
State,,,,,,,,,,
Alabama,04000US01,37150,37952,42212,44476,39980,40933,42590,43464,41381
Alaska,04000US02,55891,56418,62993,63989,61604,57848,57431,63648,61137
Arizona,04000US04,45245,46657,62993,46914,45739,46896,48621,47044,50602
Arkansas,04000US05,36658,37057,40795,39586,36538,38587,41302,39018,39919
California,04000US06,51755,55319,55734,57014,56134,54283,53367,57020,57528

### State with highest average income in the last three years

In [118]:
d["last three years avg"]=d.iloc[:,-3:].mean(1)       
d                                                                # state--->row wise

,GEOID,2005,2006,2007,2008,2009,2010,2011,2012,2013,last three years avg
State,,,,,,,,,,,
Alabama,04000US01,37150,37952,42212,44476,39980,40933,42590,43464,41381,42428.703704
Alaska,04000US02,55891,56418,62993,63989,61604,57848,57431,63648,61137,62208.740741
Arizona,04000US04,45245,46657,62993,46914,45739,46896,48621,47044,50602,48815.518519
Arkansas,04000US05,36658,37057,40795,39586,36538,38587,41302,39018,39919,39536.407407
California,04000US06,51755,55319,55734,57014,56134,54283,53367,57020,57528,57129.296296

In [121]:
d["last three years avg"]==max(d["last three years avg"])             #boolean masking

State
Alabama       False
Alaska         True
Arizona       False
Arkansas      False
California    False
Name: last three years avg, dtype: bool

In [122]:
d[d["last three years avg"]==max(d["last three years avg"])].index[0]

'Alaska'

###  State with lowest average income from 2007 to 2010(inclusive)

In [125]:
d.iloc[:,3:7].mean(1).idxmin()                 #another form of boolean masking

'Arkansas'

### Print the list of all states in the same line with average income less than California

In [139]:
a=d.iloc[:,2:].mean(1)
a

State
Alabama       41712.967078
Alaska        60808.526749
Arizona       49364.613169
Arkansas      39148.711934
California    55947.588477
dtype: float64

In [142]:
calavg=d.iloc[-1,2:].mean()
calavg

55947.588477366255

In [143]:
d.iloc[:,2:].mean(1)<calavg

State
Alabama        True
Alaska        False
Arizona        True
Arkansas       True
California    False
dtype: bool

In [145]:
list(d[d.iloc[:,2:].mean(1)<calavg].index)

['Alabama', 'Arizona', 'Arkansas']

###  Print the names of states based on descending order of income in the year 2009

In [152]:
a=d.iloc[:,6]
a

State
Alabama       40933
Alaska        57848
Arizona       46896
Arkansas      38587
California    54283
Name: 2010, dtype: int64

In [153]:
b=a.sort_values(ascending=False)
b

State
Alaska        57848
California    54283
Arizona       46896
Alabama       40933
Arkansas      38587
Name: 2010, dtype: int64

In [155]:
list(b.index)

['Alaska', 'California', 'Arizona', 'Alabama', 'Arkansas']

### State with the lowest recorded income from 2005 to 2013'''

In [163]:
d.iloc[:,1:11].idxmin()

2005                    Arkansas
2006                    Arkansas
2007                    Arkansas
2008                    Arkansas
2009                    Arkansas
2010                    Arkansas
2011                    Arkansas
2012                    Arkansas
2013                    Arkansas
last three years avg    Arkansas
dtype: object